; domain
(define
	(domain somedomain)
	(:requirements :strips :typing)
	(:types
		airport
		cargo
		plane
	)
	(:predicates
		(cargo-at ?c - cargo ?a - airport)
		(in ?c - cargo ?p - plane)
		(plane-at ?p - plane ?a - airport)
	)
	(:action fly
		:parameters (?p - plane ?orig - airport ?dest - airport)
		:precondition (plane-at ?p ?orig)
		:effect (and (not (plane-at ?p ?orig)) (plane-at ?p ?dest))
	)
	(:action load
		:parameters (?c - cargo ?p - plane ?a - airport)
		:precondition (and (cargo-at ?c ?a) (plane-at ?p ?a))
		:effect (and (not (cargo-at ?c ?a)) (in ?c ?p))
	)
	(:action unload
		:parameters (?c - cargo ?p - plane ?a - airport)
		:precondition (and (in ?c ?p) (plane-at ?p ?a))
		:effect (and (cargo-at ?c ?a) (not (in ?c ?p)))
	)
)

; problem
(define
	(problem someproblem)
	(:domain somedomain)
	(:objects
		sfo jfk - airport
		c1 c2 - cargo
		p1 p2 - plane
	)
	(:init (cargo-at c1 sfo) (cargo-at c2 jfk) (plane-at p1 sfo) (plane-at p2 jfk))
	(:goal (and (cargo-at c1 jfk) (cargo-at c2 sfo)))
)

; plan
1. (load c2 p2 jfk)
   deleted: (cargo-at c2 jfk)
   added: (in c2 p2)
   goals met: 0 of 2
2. (fly p2 jfk sfo)
   deleted: (plane-at p2 jfk)
   added: (plane-at p2 sfo)
   goals met: 0 of 2
3. (unload c2 p2 sfo)
   deleted: (in c2 p2)
   added: (cargo-at c2 sfo)
   goals met: 1 of 2
4. (load c1 p2 sfo)
   deleted: (cargo-at c1 sfo)
   added: (in c1 p2)
   goals met: 1 of 2
5. (fly p2 sfo jfk)
   deleted: (plane-at p2 sfo)
   added: (plane-at p2 jfk)
   goals met: 1 of 2
6. (unload c1 p2 jfk)
   deleted: (in c1 p2)
   added: (cargo-at c1 jfk)
   goals met: 2 of 2
